patrickstreit/STM32CubeN6/Projects/STM32N6570-DK/Applications/VENC/VENC_SDCard_ThreadX/Appli/Core/Src/csi_probe.c
uint32_t csi_probe_dt_bpp_code(uint32_t dt)
{
  switch (csi_probe_dt_bpp(dt))
  {
    case 10U: return DCMIPP_CSI_DT_BPP10;
    case 12U: return DCMIPP_CSI_DT_BPP12;
    case 14U: return DCMIPP_CSI_DT_BPP14;
    case 16U: return DCMIPP_CSI_DT_BPP16;
    default:  return DCMIPP_CSI_DT_BPP8;
  }
}

/** @brief Was data type @p dt observed on this virtual channel? */
static bool dt_seen(const csi_probe_vc_info_t *info, uint32_t dt)
{
  return (dt < 32U) ? ((info->dt_mask_lo & (1UL << dt)) != 0U)
                    : ((info->dt_mask_hi & (1UL << (dt - 32U))) != 0U);
}

uint32_t csi_probe_bitrate_profile(uint32_t mbps, uint32_t *applied_mbps)
{
  uint32_t best_idx  = 0U;
  uint32_t best_diff = 0xFFFFFFFFU;

  for (uint32_t i = 0U; i < CSI_PHY_PROFILE_COUNT; i++)
  {
    uint32_t profile = csi_phy_profile_mbps[i];
    uint32_t diff    = (profile > mbps) ? (profile - mbps) : (mbps - profile);
    if (diff < best_diff)
    {
      best_diff = diff;
      best_idx  = i;
    }
  }

  if (applied_mbps != NULL)
  {
    *applied_mbps = csi_phy_profile_mbps[best_idx];
  }
  return best_idx;
}

/* ------------------------------------------------------------------------- */
/* Virtual channel start/stop                                                */
/* ------------------------------------------------------------------------- */

/** @brief Stop every virtual channel and wait until none is active any more. */
static void csi_stop_all_vc(void)
{
  uint32_t tickstart;
  uint32_t active_mask = CSI_SR0_VC0STATEF | (CSI_SR0_VC0STATEF << 1) |
                         (CSI_SR0_VC0STATEF << 2) | (CSI_SR0_VC0STATEF << 3);

  for (uint32_t vc = 0U; vc < CSI_PROBE_VC_COUNT; vc++)
  {
    SET_BIT(CSI->CR, vc_stop_bit[vc]);
  }

  tickstart = HAL_GetTick();
  while ((CSI->SR0 & active_mask) != 0U)
  {
    if ((HAL_GetTick() - tickstart) > 50U)
    {
      break;
    }
  }

  /* The HAL pipe-start path arms SOF/EOF interrupts per channel; make sure none
     is left armed behind the probe's back. */
  __HAL_DCMIPP_CSI_DISABLE_IT(CSI, DCMIPP_CSI_IT_SOF0 | DCMIPP_CSI_IT_SOF1 |
                              DCMIPP_CSI_IT_SOF2 | DCMIPP_CSI_IT_SOF3 |
                              DCMIPP_CSI_IT_EOF0 | DCMIPP_CSI_IT_EOF1 |
                              DCMIPP_CSI_IT_EOF2 | DCMIPP_CSI_IT_EOF3);

  /* Stopping a channel part way through a frame raises sync and SOT errors of
     the probe's own making. Every caller stops channels only after it has
     finished accumulating, so dropping those flags here loses nothing - and it
     stops the HAL error callback from reporting them the moment the CSI
     interrupt is re-enabled, which read as a link fault in the middle of an
     otherwise error-free measurement. */
  CSI->FCR0 = 0xFFFFFFFFU;
  CSI->FCR1 = 0xFFFFFFFFU;
  hcamera_dcmipp.ErrorCode = HAL_DCMIPP_ERROR_NONE;
}

/**
  * @brief  Start one virtual channel and wait for it to report the active state.
  * @note   The channel only becomes active once the receiver has seen a frame
  *         start on it, so the timeout has to cover at least one frame period.
  * @retval false on timeout; the caller may still continue, the measurement
  *         will then simply find nothing.
  */
static bool csi_start_vc(uint32_t vc, uint32_t timeout_ms)
{
  uint32_t tickstart;

  SET_BIT(CSI->CR, vc_start_bit[vc]);

  tickstart = HAL_GetTick();
  while ((CSI->SR0 & (CSI_SR0_VC0STATEF << vc)) == 0U)
  {
    if ((HAL_GetTick() - tickstart) > timeout_ms)
    {
      return false;
    }
  }
  return true;
}

HAL_StatusTypeDef csi_probe_apply_phy(const csi_probe_phy_t *phy)
{
  DCMIPP_CSI_ConfTypeDef csiconf = {0};

  if (phy == NULL)
  {
    return HAL_ERROR;
  }

  /* Applying a setting resets the D-PHY and therefore drops the link, which then
     costs a source restart - a manual one, in the default mode. Re-applying the
     setting that is already programmed would do that for nothing. */
  if ((g_applied_phy.mbps == phy->mbps) &&
      (g_applied_phy.lanes == phy->lanes) &&
      (g_applied_phy.swapped == phy->swapped))
  {
    g_phy_reapplied = false;
    return HAL_OK;
  }
  g_phy_reapplied = true;

  csi_stop_all_vc();

  csiconf.NumberOfLanes   = (phy->lanes == 1U) ? DCMIPP_CSI_ONE_DATA_LANE
                                               : DCMIPP_CSI_TWO_DATA_LANES;
  csiconf.DataLaneMapping = (phy->swapped != 0U) ? DCMIPP_CSI_INVERTED_DATA_LANES
                                                 : DCMIPP_CSI_PHYSICAL_DATA_LANES;
  csiconf.PHYBitrate      = csi_probe_bitrate_profile(phy->mbps, NULL);

  if (HAL_DCMIPP_CSI_SetConfig(&hcamera_dcmipp, &csiconf) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* SetConfig() drives the D-PHY through reset and toggles its test interface.
     The flags that come out of that are an artefact of the reconfiguration, not
     a property of the link, so let it settle and drop them. Without this the
     sweep reports SOT errors on a random-looking subset of bitrates. */
  HAL_Delay(CSI_PHY_SETTLE_MS);
  CSI->FCR0 = 0xFFFFFFFFU;
  CSI->FCR1 = 0xFFFFFFFFU;

  g_applied_phy = *phy;
  return HAL_OK;
}

void csi_probe_source_restart(uint32_t settle_ms)
{
  /* Cycles the camera connector's power and reset lines. This has to happen
     *after* the receiver is configured: a D-PHY transmitter that starts while
     the receiver is still in reset is never picked up, and every bitrate change
     puts the receiver through reset again. */
  (void)BSP_CAMERA_HwReset(0);
  HAL_Delay(settle_ms);
}

void csi_probe_set_source_mode(csi_source_mode_t mode)
{
  g_source_mode = mode;
}

csi_source_mode_t csi_probe_get_source_mode(void)
{
  return g_source_mode;
}

uint32_t csi_probe_source_cycle_wait(uint32_t timeout_ms)
{
  uint32_t tickstart;
  uint32_t elapsed  = 0U;
  uint32_t next_dot = 1000U;

  if (timeout_ms == 0U)
  {
    timeout_ms = (g_source_mode == CSI_SOURCE_AUTO) ? CSI_SOURCE_AUTO_TIMEOUT_MS
                                                    : CSI_SOURCE_MANUAL_TIMEOUT_MS;
  }

  if (g_source_mode == CSI_SOURCE_AUTO)
  {
    (void)BSP_CAMERA_HwReset(0);
  }
  else
  {
    printf("CSI: power-cycle the source now (waiting up to %lu s for its clock)\n",
           (unsigned long)(timeout_ms / 1000U));
  }

  tickstart = HAL_GetTick();
  while ((CSI->SR1 & CSI_SR1_ACTCLF) == 0U)
  {
    elapsed = HAL_GetTick() - tickstart;
    if (elapsed >= timeout_ms)
    {
      printf("\nCSI: no clock after %lu s\n", (unsigned long)(timeout_ms / 1000U));
      return 0U;
    }

    /* One dot per second, so a long manual wait does not look like a hang. */
    if ((g_source_mode == CSI_SOURCE_MANUAL) && (elapsed >= next_dot))
    {
      printf(".");
      fflush(stdout);
      next_dot += 1000U;
    }
  }

  if (g_source_mode == CSI_SOURCE_MANUAL)
  {
    printf("\n");
  }

  /* Clock is there; give the lanes time to synchronise and a frame to start. */
  HAL_Delay(CSI_SOURCE_SYNC_GRACE_MS);
  return elapsed + 1U;
}

/* ------------------------------------------------------------------------- */
/* Observation                                                               */
/* ------------------------------------------------------------------------- */

