patrickstreit/STM32CubeN6/Projects/STM32N6570-DK/Applications/VENC/VENC_SDCard_ThreadX/Appli/Core/Src/csi_probe.c
        if ((result.sr1 & CSI_SR1_ACTCLF) != 0U)
        {
          clock_seen = true;
        }

        frames = csi_result_frames(&result);
        errors = result.err_ecc + result.err_crc + result.err_phy;
        clean  = (errors == 0U);

        /* Only rows that carry information; a full sweep is otherwise four
           screens of "nothing here". */
        if ((frames != 0U) || (result.sr0 != 0U) || (result.sr1 != 0U))
        {
          csi_print_scan_row(&result);
        }

        if (frames == 0U)
        {
          continue;
        }
        found = true;

        /* Rank by frames first, then by how quiet the link was. Frames are the
           thing being asked for; error count is what separates two settings that
           both deliver them, which is the case that matters when the source sits
           between two D-PHY profiles. */
        if ((frames > best_frames) ||
            ((frames == best_frames) && (errors < best_errors)))
        {
          best_clean  = clean;
          best_frames = frames;
          best_errors = errors;
          winner      = phy;
        }
      }
    }
  }

  if (!found)
  {
    printf("CSI: no virtual channel produced a complete frame at any setting.\n");
    if (!clock_seen)
    {
      /* Without a clock the bitrate is irrelevant: nothing is being transmitted,
         or the transmitter came up before the receiver did. */
      printf("     The D-PHY clock lane was never active, at any bitrate. That is not a\n");
      printf("     bitrate mismatch - no high-speed clock reached the receiver at all.\n");
      printf("     Try 'power cycle' followed by 'link', and check that the source is\n");
      printf("     actually transmitting and that its power rail comes up.\n");
    }
    else
    {
      printf("     A clock was seen but no frame completed. Refine the bitrate around the\n");
      printf("     rows that showed lane sync, and check the lane mapping.\n");
    }
    return false;
  }

  printf("CSI: best setting %u Mbit/s, %u lane(s), %s mapping (%lu frames, %s)\n",
         (unsigned)winner.mbps, (unsigned)winner.lanes,
         (winner.swapped != 0U) ? "inverted" : "physical",
         (unsigned long)best_frames, best_clean ? "no errors" : "with errors");

  if (best != NULL)
  {
    *best = winner;
  }
  return true;
}

/* ------------------------------------------------------------------------- */
/* Link watch                                                                */
/* ------------------------------------------------------------------------- */

bool csi_probe_wait_for_link(const csi_probe_phy_t *phy, uint32_t timeout_ms)
{
  uint32_t tickstart;
  uint32_t seen_sr0 = 0U;
  uint32_t seen_sr1 = 0U;
  uint32_t t_clock  = 0U;
  uint32_t t_sync   = 0U;
  uint32_t t_frame  = 0U;

  if (phy == NULL)
  {
    return false;
  }

  if (timeout_ms == 0U)
  {
    timeout_ms = (g_source_mode == CSI_SOURCE_AUTO) ? CSI_SOURCE_AUTO_TIMEOUT_MS
                                                    : CSI_SOURCE_MANUAL_TIMEOUT_MS;
  }

  HAL_NVIC_DisableIRQ(CSI_IRQn);

  if (csi_probe_apply_phy(phy) != HAL_OK)
  {
    HAL_NVIC_EnableIRQ(CSI_IRQn);
    printf("CSI: applying %u Mbit/s failed\n", (unsigned)phy->mbps);
    return false;
  }

  for (uint32_t vc = 0U; vc < CSI_PROBE_VC_COUNT; vc++)
  {
    (void)HAL_DCMIPP_CSI_SetVCConfig(&hcamera_dcmipp, vc, DCMIPP_CSI_DT_BPP8);
    SET_BIT(CSI->CR, vc_start_bit[vc]);
  }

  printf("CSI: receiver up at %u Mbit/s, %u lane(s), %s mapping. Watching for %lu ms.\n",
         (unsigned)phy->mbps, (unsigned)phy->lanes,
         (phy->swapped != 0U) ? "inverted" : "physical", (unsigned long)timeout_ms);

  if (g_source_mode == CSI_SOURCE_AUTO)
  {
    printf("CSI: cycling the source's power and reset lines\n");
    /* No settle delay here: the point of this function is to watch the link come
       up, so the wait belongs inside the loop where it can be timed. */
    (void)BSP_CAMERA_HwReset(0);
  }
  else
  {
    printf("CSI: >>> power-cycle the source now <<<\n");
  }

  CSI->FCR0 = 0xFFFFFFFFU;
  CSI->FCR1 = 0xFFFFFFFFU;

  tickstart = HAL_GetTick();
  while ((HAL_GetTick() - tickstart) < timeout_ms)
  {
    uint32_t sr0     = CSI->SR0;
    uint32_t sr1     = CSI->SR1;
    uint32_t elapsed = HAL_GetTick() - tickstart;

    if (((sr1 & CSI_SR1_ACTCLF) != 0U) && (t_clock == 0U))
    {
      t_clock = elapsed + 1U;
    }
    if (((sr1 & (CSI_SR1_SYNCDL0F | CSI_SR1_SYNCDL1F)) != 0U) && (t_sync == 0U))
    {
      t_sync = elapsed + 1U;
    }
    if (((sr0 & (CSI_SR0_EOF0F | CSI_SR0_EOF1F | CSI_SR0_EOF2F | CSI_SR0_EOF3F)) != 0U) &&
        (t_frame == 0U))
    {
      t_frame = elapsed + 1U;
    }

    seen_sr0 |= sr0;
    seen_sr1 |= sr1;

    /* Keep the frame flags moving so a stalled link is distinguishable from one
       that delivered a single frame and stopped. */
    CSI->FCR0 = sr0 & (CSI_SR0_SOF0F | CSI_SR0_SOF1F | CSI_SR0_SOF2F | CSI_SR0_SOF3F |
                       CSI_SR0_EOF0F | CSI_SR0_EOF1F | CSI_SR0_EOF2F | CSI_SR0_EOF3F);

    if ((t_frame != 0U) && (elapsed > (t_frame + 200U)))
    {
      break;   /* frames are flowing, no need to sit out the whole timeout */
    }
  }

  csi_stop_all_vc();
  HAL_NVIC_EnableIRQ(CSI_IRQn);

  printf("CSI: clock %s", (t_clock != 0U) ? "" : "never active");
  if (t_clock != 0U) { printf("active after %lu ms", (unsigned long)(t_clock - 1U)); }
  printf(", lane sync %s", (t_sync != 0U) ? "" : "never");
  if (t_sync != 0U) { printf("after %lu ms", (unsigned long)(t_sync - 1U)); }
  printf(", first frame %s", (t_frame != 0U) ? "" : "never");
  if (t_frame != 0U) { printf("after %lu ms", (unsigned long)(t_frame - 1U)); }
  printf("\n");

  if (t_clock == 0U)
  {
    printf("CSI: no high-speed clock. The bitrate setting is irrelevant until this\n");
    printf("     changes - the source is not transmitting, or its rail never came up.\n");
  }
  else if (t_sync == 0U)
  {
    printf("CSI: clock but no lane sync - this is where the bitrate setting matters.\n");
  }
  else if (t_frame == 0U)
  {
    printf("CSI: lanes in sync but no end-of-frame - check the lane mapping and\n");
    printf("     whether the source sends frame start/end short packets.\n");
  }

  return t_frame != 0U;
}

/* ------------------------------------------------------------------------- */
/* Refine                                                                    */
/* ------------------------------------------------------------------------- */

bool csi_probe_refine(csi_probe_phy_t *phy, uint32_t neighbours, uint32_t window_ms)
{
  csi_probe_result_t result;
  csi_probe_phy_t    winner      = {0};
  uint32_t           centre_idx;
  uint32_t           first_idx;
  uint32_t           last_idx;
  uint32_t           best_frames = 0U;
  uint32_t           best_errors = 0xFFFFFFFFU;
  bool               found       = false;

