patrickstreit/STM32CubeN6/Projects/STM32N6570-DK/Applications/VENC/VENC_SDCard_ThreadX/Appli/Core/Src/csi_probe.c
  if (phy == NULL)
  {
    return false;
  }

  centre_idx = csi_probe_bitrate_profile(phy->mbps, NULL);
  first_idx  = (centre_idx > neighbours) ? (centre_idx - neighbours) : 0U;
  last_idx   = centre_idx + neighbours;
  if (last_idx >= CSI_PHY_PROFILE_COUNT)
  {
    last_idx = CSI_PHY_PROFILE_COUNT - 1U;
  }

  printf("CSI: comparing profiles %u..%u Mbit/s around %u, %u lane(s), %s mapping\n",
         (unsigned)csi_phy_profile_mbps[first_idx],
         (unsigned)csi_phy_profile_mbps[last_idx],
         (unsigned)phy->mbps, (unsigned)phy->lanes,
         (phy->swapped != 0U) ? "inverted" : "physical");
  printf("CSI: %lu profiles, each needs the source restarted\n",
         (unsigned long)((last_idx - first_idx) + 1U));
  printf("  mbps  | complete frames per vc (N! = N started, none finished) | ecc crc phy\n");

  for (uint32_t idx = first_idx; idx <= last_idx; idx++)
  {
    csi_probe_phy_t candidate = *phy;
    char            vc_text[CSI_PROBE_VC_COUNT][12];
    uint32_t        frames;
    uint32_t        errors;

    candidate.mbps = csi_phy_profile_mbps[idx];

    (void)csi_probe_observe(&candidate, window_ms, true, &result);

    if (result.source_boot_ms == 0U)
    {
      printf("  %4u  | source did not start\n", (unsigned)candidate.mbps);
      continue;
    }

    for (uint32_t vc = 0U; vc < CSI_PROBE_VC_COUNT; vc++)
    {
      csi_format_vc(vc_text[vc], sizeof(vc_text[vc]), result.sof[vc], result.eof[vc]);
    }

    frames = csi_result_frames(&result);
    errors = result.err_ecc + result.err_crc + result.err_phy;

    printf("  %4u  | %5s %5s %5s %5s | %3lu %3lu %3lu\n",
           (unsigned)candidate.mbps,
           vc_text[0], vc_text[1], vc_text[2], vc_text[3],
           (unsigned long)result.err_ecc, (unsigned long)result.err_crc,
           (unsigned long)result.err_phy);

    if (frames == 0U)
    {
      continue;
    }
    found = true;

    /* Frames first, then quietness - the same ranking the sweep uses, which is
       what makes the two comparable. */
    if ((frames > best_frames) || ((frames == best_frames) && (errors < best_errors)))
    {
      best_frames = frames;
      best_errors = errors;
      winner      = candidate;
    }
  }

  if (!found)
  {
    printf("CSI: no profile in that range delivered a frame\n");
    return false;
  }

  /* "frames" here means frames that finished. A row showing 20! delivered no
     complete frame at all and so ranks below a row with a single real one, which
     looks wrong at a glance unless the units are spelled out. */
  printf("CSI: quietest is %u Mbit/s (%lu complete frames, %lu errors)\n",
         (unsigned)winner.mbps, (unsigned long)best_frames, (unsigned long)best_errors);
  printf("CSI: one window per profile and one restart each, so a small difference\n");
  printf("     between neighbours is noise rather than a ranking. Repeat to confirm.\n");
  *phy = winner;
  return true;
}

/* ------------------------------------------------------------------------- */
/* Data type identification                                                  */
/* ------------------------------------------------------------------------- */

/* Long-packet data types worth trying: the CSI-2 image range plus the
   user-defined block, which is where a bridge or an FPGA usually puts a format
   the standard does not cover. Short packets - the frame and line delimiters -
   are deliberately absent. They are not subject to data type filtering, so they
   cannot be identified this way, and pretending otherwise produced an "other
   packets:" line that was permanently empty. */
static const uint8_t csi_dt_candidates[] =
{
  0x18U, 0x19U, 0x1AU, 0x1CU, 0x1DU, 0x1EU, 0x1FU,          /* YUV           */
  0x20U, 0x21U, 0x22U, 0x23U, 0x24U,                        /* RGB           */
  0x28U, 0x29U, 0x2AU, 0x2BU, 0x2CU, 0x2DU, 0x2EU, 0x2FU,   /* RAW6 .. RAW20 */
  0x30U, 0x31U, 0x32U, 0x33U, 0x34U, 0x35U, 0x36U, 0x37U    /* user defined  */
};
#define CSI_DT_CANDIDATE_COUNT (sizeof(csi_dt_candidates) / sizeof(csi_dt_candidates[0]))

/**
  * @brief  Offer the receiver exactly one data type and see whether data flows.
  * @param  lb_hit  out: how many times the line/byte counter reached line 1
  *                 byte 1, i.e. how much data of this type was accepted. A
  *                 count rather than a flag, because a single hit over several
  *                 thousand packets is a corrupted header, not a second stream
  * @param  id_err  out: how often the ID error flag re-asserted after being
  *                 cleared - roughly, how many packets were rejected
  *
  * Two independent signals on purpose. The first reads the datapath, the second
  * the error path, and they come from different registers; if one of them turns
  * out to be useless that shows up as a column of identical values rather than
  * as a wrong answer.
  */
static void dt_trial_n(uint32_t vc, const uint8_t *dts, uint32_t count, uint32_t window_ms,
                       uint32_t *lb_hit, uint32_t *id_err)
{
  DCMIPP_CSI_VCFilteringConfTypeDef     filter = {0};
  DCMIPP_CSI_LineByteCounterConfTypeDef cnt    = {0};
  uint32_t tickstart;

  *lb_hit = 0U;
  *id_err = 0U;

  csi_stop_all_vc();

  /* Accept these data types and nothing else. */
  filter.DataTypeNB = count;
  for (uint32_t i = 0U; i < count; i++)
  {
    filter.DataTypeClass[i]  = dts[i];
    filter.DataTypeFormat[i] = csi_probe_dt_bpp_code(dts[i]);
  }
  (void)HAL_DCMIPP_CSI_SetVCFilteringConfig(&hcamera_dcmipp, vc, &filter);

  cnt.VirtualChannel = vc;
  cnt.LineCounter    = 1U;
  cnt.ByteCounter    = 1U;
  (void)HAL_DCMIPP_CSI_SetLineByteCounterConfig(&hcamera_dcmipp, DCMIPP_CSI_COUNTER0, &cnt);

  (void)csi_start_vc(vc, window_ms);

  SET_BIT(CSI->PRGITR, CSI_PRGITR_LB0EN);
  CSI->FCR0 = 0xFFFFFFFFU;

  tickstart = HAL_GetTick();
  while ((HAL_GetTick() - tickstart) < window_ms)
  {
    uint32_t sr0 = CSI->SR0;

    if ((sr0 & CSI_SR0_LB0F) != 0U)
    {
      (*lb_hit)++;
      CSI->FCR0 = CSI_SR0_LB0F;
    }
    if ((sr0 & CSI_SR0_IDERRF) != 0U)
    {
      /* Clearing the flag and counting how often it comes back measures a rate.
         Reading the data type out of CSI_ERR1 instead does not: that field
         latches and is not re-armed by clearing the status flag, so a polling
         loop reads one stale value thousands of times and then reports it as an
         overwhelming majority. That is why every link - clean or marginal, at
         every bitrate - named the same single data type. */
      (*id_err)++;
      CSI->FCR0 = CSI_SR0_IDERRF;
    }
  }

  CLEAR_BIT(CSI->PRGITR, CSI_PRGITR_LB0EN);
  csi_stop_all_vc();
}

static void dt_trial(uint32_t vc, uint32_t dt, uint32_t window_ms,
                     uint32_t *lb_hit, uint32_t *id_err)
{
  uint8_t one = (uint8_t)dt;

  dt_trial_n(vc, &one, 1U, window_ms, lb_hit, id_err);
}

/* Lives further down, with the counter searches it needs. */
static void dt_disambiguate(uint32_t vc, uint32_t dt_a, uint32_t dt_b, uint32_t window_ms);

