patrickstreit/STM32CubeN6/Projects/STM32N6570-DK/Applications/VENC/VENC_SDCard_ThreadX/Appli/Core/Src/csi_probe.c
void csi_probe_datatypes(uint32_t vc, uint32_t window_ms, csi_probe_vc_info_t *info)
{
  /* static: keeps ~150 bytes off a thread stack that is only 4 kB. */
  static uint32_t id_err[CSI_DT_CANDIDATE_COUNT];
  static uint32_t lb_hit[CSI_DT_CANDIDATE_COUNT];
  uint32_t accepted = 0U;
  uint32_t quietest = 0U;
  uint32_t best_idx = 0U;
  uint32_t per_dt_ms;
  bool     found    = false;

  if ((info == NULL) || (vc >= CSI_PROBE_VC_COUNT))
  {
    return;
  }

  info->dt_mask_lo     = 0U;
  info->dt_mask_hi     = 0U;
  info->image_dt       = 0U;
  info->image_dt_count = 0U;
  info->dt_corrupt     = 0U;

  /* Enough for several frame periods per candidate, so "no data" means absence
     rather than a window that happened to fall into vertical blanking. */
  per_dt_ms = window_ms / 2U;
  if (per_dt_ms < 100U)
  {
    per_dt_ms = 100U;
  }

  HAL_NVIC_DisableIRQ(CSI_IRQn);

  for (uint32_t i = 0U; i < CSI_DT_CANDIDATE_COUNT; i++)
  {
    dt_trial(vc, csi_dt_candidates[i], per_dt_ms, &lb_hit[i], &id_err[i]);
  }

  /* Leave the channel accepting everything again, so nothing downstream trips
     over a filter the probe left behind. */
  (void)HAL_DCMIPP_CSI_SetVCConfig(&hcamera_dcmipp, vc, DCMIPP_CSI_DT_BPP8);
  HAL_NVIC_EnableIRQ(CSI_IRQn);

  /* The whole table, not a summary. A summary is what hid the fact that the
     previous method only ever saw a single value. */
  printf("CSI: VC%lu data type walk, %lu ms per candidate\n",
         (unsigned long)vc, (unsigned long)per_dt_ms);
  printf("        DT   name          accepted  rejected\n");
  for (uint32_t i = 0U; i < CSI_DT_CANDIDATE_COUNT; i++)
  {
    printf("       0x%02x  %-12s  %-8lu  %lu\n",
           (unsigned)csi_dt_candidates[i],
           csi_probe_dt_name(csi_dt_candidates[i]),
           (unsigned long)lb_hit[i],
           (unsigned long)id_err[i]);

    if (lb_hit[i] != 0U)
    {
      uint32_t dt = csi_dt_candidates[i];

      accepted++;
      if (dt < 32U)
      {
        info->dt_mask_lo |= (1UL << dt);
      }
      else
      {
        info->dt_mask_hi |= (1UL << (dt - 32U));
      }
      /* Most data wins; on a tie prefer a data type this receiver has a word
         format for. The filter turned out not to distinguish 0x2b from 0x2f -
         they differ in one bit, both accept the same RAW10 stream, and both
         come back with an identical count - but 0x2f is RAW20, and the DCMIPP
         stops at 16-bit words, so it cannot be what is being received.
         Without this the choice between them was decided by which frame
         boundary the window happened to straddle, and picking 0x2f left the
         geometry running at 8 bpp on a 10 bpp stream. */
      if (!found || (lb_hit[i] > lb_hit[best_idx]) ||
          ((lb_hit[i] == lb_hit[best_idx]) && (csi_probe_dt_bpp(dt) != 0U) &&
           (csi_probe_dt_bpp(csi_dt_candidates[best_idx]) == 0U)))
      {
        best_idx = i;
        found    = true;
      }
    }
    if (id_err[i] < id_err[quietest])
    {
      quietest = i;
    }
  }

  info->image_dt_count = accepted;

  if (accepted == 1U)
  {
    info->image_dt = csi_dt_candidates[best_idx];
    printf("CSI: VC%lu carries 0x%02lx (%s) - the only type the datapath accepted\n",
           (unsigned long)vc, (unsigned long)info->image_dt,
           csi_probe_dt_name(info->image_dt));
  }
  else if (accepted == 0U)
  {
    /* Either nothing is arriving, or the line/byte counter is not gated by the
       data type filter and therefore says nothing. Fall back to the rejection
       rate and label the answer as the weaker evidence it is. */
    info->image_dt = csi_dt_candidates[quietest];
    printf("CSI: VC%lu no candidate let data through; falling back to the lowest\n"
           "     rejection count, 0x%02lx (%s) - treat this as a guess\n",
           (unsigned long)vc, (unsigned long)info->image_dt,
           csi_probe_dt_name(info->image_dt));
  }
  else
  {
    info->image_dt   = csi_dt_candidates[best_idx];
    info->dt_corrupt = accepted - 1U;
    printf("CSI: VC%lu %lu candidates accepted data; picking 0x%02lx (%s), the one\n"
           "     that accepted the most, preferring a defined data type on a tie\n",
           (unsigned long)vc, (unsigned long)accepted,
           (unsigned long)info->image_dt, csi_probe_dt_name(info->image_dt));
    if (accepted == CSI_DT_CANDIDATE_COUNT)
    {
      printf("     every candidate accepted, so the counter is not filtered by\n"
             "     data type and this column proves nothing\n");
    }
    else if (accepted == 2U)
    {
      /* Two acceptances are worth one more measurement: they are either two
         streams the receiver keeps apart or one stream its filter cannot. */
      uint32_t other_idx = best_idx;

      for (uint32_t i = 0U; i < CSI_DT_CANDIDATE_COUNT; i++)
      {
        if ((lb_hit[i] != 0U) && (i != best_idx))
        {
          other_idx = i;
        }
      }
      dt_disambiguate(vc, csi_dt_candidates[best_idx], csi_dt_candidates[other_idx],
                      per_dt_ms);
    }
    else
    {
      /* Nothing further: with three or more the pairwise test below would need
         a decision about which pair to run, and that decision has no basis. */
    }
  }
}

/* ------------------------------------------------------------------------- */
/* Channel survey                                                            */
/* ------------------------------------------------------------------------- */

void csi_probe_vc_survey(uint32_t window_ms)
{
  uint32_t hits[CSI_PROBE_VC_COUNT]   = {0};
  uint32_t sticky[CSI_PROBE_VC_COUNT] = {0};
  uint32_t carrying = 0U;

  if (window_ms < 100U)
  {
    window_ms = 100U;
  }

  HAL_NVIC_DisableIRQ(CSI_IRQn);

  for (uint32_t vc = 0U; vc < CSI_PROBE_VC_COUNT; vc++)
  {
    DCMIPP_CSI_LineByteCounterConfTypeDef cnt = {0};
    uint32_t tickstart;

    csi_stop_all_vc();

    /* Every data type: a channel carrying something this probe has no name for
       still has to show up here. That is the whole point of asking one channel
       at a time instead of trusting the frame-start flags of a shared window. */
    (void)HAL_DCMIPP_CSI_SetVCConfig(&hcamera_dcmipp, vc, DCMIPP_CSI_DT_BPP8);

    cnt.VirtualChannel = vc;
    cnt.LineCounter    = 1U;
    cnt.ByteCounter    = 1U;
    (void)HAL_DCMIPP_CSI_SetLineByteCounterConfig(&hcamera_dcmipp, DCMIPP_CSI_COUNTER0, &cnt);

    /* The channel only reaches its active state on a frame start, so a channel
       without frame delimiters never gets there. Observe it regardless: the
       counter is armed either way, and long packets without delimiters are
       exactly one of the cases this survey exists to find. */
    (void)csi_start_vc(vc, window_ms);

    SET_BIT(CSI->PRGITR, CSI_PRGITR_LB0EN);
    CSI->FCR0 = 0xFFFFFFFFU;

    tickstart = HAL_GetTick();
    while ((HAL_GetTick() - tickstart) < window_ms)
    {
      uint32_t sr0 = CSI->SR0;

      sticky[vc] |= sr0;
      if ((sr0 & CSI_SR0_LB0F) != 0U)
      {
        hits[vc]++;
        CSI->FCR0 = CSI_SR0_LB0F;
      }
    }

    CLEAR_BIT(CSI->PRGITR, CSI_PRGITR_LB0EN);
  }

