patrickstreit/STM32CubeN6/Projects/STM32N6570-DK/Applications/VENC/VENC_SDCard_ThreadX/Appli/Core/Src/csi_probe.c
  csi_stop_all_vc();
  HAL_NVIC_EnableIRQ(CSI_IRQn);

  printf("CSI: virtual channel survey, %lu ms each, every data type accepted\n",
         (unsigned long)window_ms);
  printf("        VC  active  frame starts  frame ends  data\n");
  for (uint32_t vc = 0U; vc < CSI_PROBE_VC_COUNT; vc++)
  {
    printf("        %lu   %-6s  %-12s  %-10s  %lu\n",
           (unsigned long)vc,
           ((sticky[vc] & (CSI_SR0_VC0STATEF << vc)) != 0U) ? "yes" : "no",
           ((sticky[vc] & (CSI_SR0_SOF0F << vc))     != 0U) ? "yes" : "no",
           ((sticky[vc] & (CSI_SR0_EOF0F << vc))     != 0U) ? "yes" : "no",
           (unsigned long)hits[vc]);

    if ((hits[vc] != 0U) || ((sticky[vc] & (CSI_SR0_SOF0F << vc)) != 0U))
    {
      carrying++;
    }
  }

  for (uint32_t vc = 0U; vc < CSI_PROBE_VC_COUNT; vc++)
  {
    if ((hits[vc] != 0U) && ((sticky[vc] & (CSI_SR0_SOF0F << vc)) == 0U))
    {
      printf("     VC%lu has long packets but no frame start; it carries data\n"
             "     without frame delimiters. 'dt %lu' will name the type\n",
             (unsigned long)vc, (unsigned long)vc);
    }
  }

  if (carrying <= 1U)
  {
    /* Worth saying explicitly, because "we only found one" invites the question
       of whether the receiver could even have found a second one. */
    printf("     one channel only. This receiver has start/stop, status and\n"
           "     filtering for VC0..VC3 and nothing for the extended channels\n"
           "     CSI-2 v2.0 added, so a source transmitting on VC4..VC15 is\n"
           "     silence here rather than an error - if a second channel is\n"
           "     expected, that is worth checking at the transmitter\n");
  }
}

/* ------------------------------------------------------------------------- */
/* Geometry                                                                  */
/* ------------------------------------------------------------------------- */

/**
  * @brief  Does virtual channel @p vc reach (@p line, @p byte) inside one frame?
  * @note   Uses CSI line/byte counter 0, which only raises a status flag. No
  *         DCMIPP pipe is involved, so an unknown resolution cannot overrun any
  *         buffer - that is the whole reason the geometry is measured this way.
  */
static bool csi_reaches(uint32_t vc, uint32_t line, uint32_t byte, uint32_t timeout_ms)
{
  DCMIPP_CSI_LineByteCounterConfTypeDef cnt = {0};
  uint32_t tickstart;
  bool     reached = false;

  cnt.VirtualChannel = vc;
  cnt.LineCounter    = line;
  cnt.ByteCounter    = byte;
  (void)HAL_DCMIPP_CSI_SetLineByteCounterConfig(&hcamera_dcmipp, DCMIPP_CSI_COUNTER0, &cnt);

  /* Enable the counter but not its interrupt: the flag is polled. */
  SET_BIT(CSI->PRGITR, CSI_PRGITR_LB0EN);
  CSI->FCR0 = CSI_SR0_LB0F;

  tickstart = HAL_GetTick();
  while ((HAL_GetTick() - tickstart) < timeout_ms)
  {
    if ((CSI->SR0 & CSI_SR0_LB0F) != 0U)
    {
      reached = true;
      break;
    }
  }

  CLEAR_BIT(CSI->PRGITR, CSI_PRGITR_LB0EN);
  CSI->FCR0 = CSI_SR0_LB0F;

  return reached;
}

/* Byte 1 rather than byte 0 on both axes. Whether a byte count of zero ever
   counts as reached is not documented, and using one convention for both
   searches at least makes the two comparable. */
static bool probe_line(uint32_t vc, uint32_t value, uint32_t timeout_ms)
{
  return csi_reaches(vc, value, 1U, timeout_ms);
}

/* Which line probe_byte() interrogates. Line 1 is a poor default on a real
   source: the first line of a frame is often embedded data or blanking, and
   shorter than an image line, so measuring there reports a length no image line
   actually has. */
static uint32_t g_byte_probe_line = 1U;

static bool probe_byte(uint32_t vc, uint32_t value, uint32_t timeout_ms)
{
  return csi_reaches(vc, g_byte_probe_line, value, timeout_ms);
}

/**
  * @brief  Largest value in [1, @p hi] for which @p reached still fires.
  * @note   Only exact if "reaches N" is monotonic in N, which geom_verify()
  *         checks afterwards rather than assuming.
  */
static uint32_t csi_search_max(uint32_t vc, uint32_t hi, uint32_t timeout_ms,
                               bool (*reached)(uint32_t vc, uint32_t value, uint32_t timeout_ms))
{
  uint32_t lo   = 1U;
  uint32_t best = 0U;

  while (lo <= hi)
  {
    uint32_t mid = lo + ((hi - lo) / 2U);

    if (reached(vc, mid, timeout_ms))
    {
      best = mid;
      lo   = mid + 1U;
    }
    else
    {
      if (mid == 0U)
      {
        break;
      }
      hi = mid - 1U;
    }
  }
  return best;
}

/**
  * @brief  Filter @p vc down to @p dt and measure the shape of what arrives.
  * @param  lines  out: largest line index the counter still reaches
  * @param  bytes  out: largest byte index it reaches, on a line in mid-frame
  *
  * Indices, not counts - this is for comparing two data types against each
  * other, and the +1 that turns an index into a count would cancel anyway.
  */
static void dt_measure_shape(uint32_t vc, uint32_t dt, uint32_t timeout_ms,
                             uint32_t *lines, uint32_t *bytes)
{
  DCMIPP_CSI_VCFilteringConfTypeDef filter = {0};

  csi_stop_all_vc();

  filter.DataTypeNB        = 1U;
  filter.DataTypeClass[0]  = dt;
  filter.DataTypeFormat[0] = csi_probe_dt_bpp_code(dt);
  (void)HAL_DCMIPP_CSI_SetVCFilteringConfig(&hcamera_dcmipp, vc, &filter);
  (void)csi_start_vc(vc, timeout_ms);

  *lines            = csi_search_max(vc, 0xFFFFU, timeout_ms, probe_line);
  g_byte_probe_line = (*lines > 2U) ? (*lines / 2U) : 1U;
  *bytes            = csi_search_max(vc, 0xFFFFU, timeout_ms, probe_byte);

  csi_stop_all_vc();
}

/**
  * @brief  Two accepted data types: two streams, or one the filter cannot split?
  *
  * Enabling both at once decides it. Two streams add up - twice the data type,
  * twice the packets, twice the counter hits. One stream matched by two filter
  * values does not: the same packets are counted once either way. The shape of
  * a line is the second, independent signal, and it comes from a different
  * mechanism than the hit count: two genuinely different formats of the same
  * picture cannot have the same number of bytes per line.
  */
static void dt_disambiguate(uint32_t vc, uint32_t dt_a, uint32_t dt_b, uint32_t window_ms)
{
  uint8_t  both[2] = { (uint8_t)dt_a, (uint8_t)dt_b };
  uint32_t hit_a;
  uint32_t hit_b;
  uint32_t hit_both;
  uint32_t err;
  uint32_t lines_a;
  uint32_t lines_b;
  uint32_t bytes_a;
  uint32_t bytes_b;
  uint32_t apart;
  uint32_t together;

  HAL_NVIC_DisableIRQ(CSI_IRQn);

