patrickstreit/STM32CubeN6/Projects/STM32N6570-DK/Applications/VENC/VENC_SDCard_ThreadX/Appli/Core/Src/csi_probe.c
  dt_trial(vc, dt_a, window_ms, &hit_a, &err);
  dt_trial(vc, dt_b, window_ms, &hit_b, &err);
  dt_trial_n(vc, both, 2U, window_ms, &hit_both, &err);

  dt_measure_shape(vc, dt_a, window_ms, &lines_a, &bytes_a);
  dt_measure_shape(vc, dt_b, window_ms, &lines_b, &bytes_b);

  /* Back to accepting everything, as the walk leaves it. */
  (void)HAL_DCMIPP_CSI_SetVCConfig(&hcamera_dcmipp, vc, DCMIPP_CSI_DT_BPP8);
  HAL_NVIC_EnableIRQ(CSI_IRQn);

  printf("CSI: VC%lu 0x%02lx and 0x%02lx both accepted - one stream or two?\n",
         (unsigned long)vc, (unsigned long)dt_a, (unsigned long)dt_b);
  printf("       0x%02lx alone     %lu hits, lines to %lu, bytes to %lu\n",
         (unsigned long)dt_a, (unsigned long)hit_a,
         (unsigned long)lines_a, (unsigned long)bytes_a);
  printf("       0x%02lx alone     %lu hits, lines to %lu, bytes to %lu\n",
         (unsigned long)dt_b, (unsigned long)hit_b,
         (unsigned long)lines_b, (unsigned long)bytes_b);
  printf("       both together  %lu hits\n", (unsigned long)hit_both);

  apart    = hit_a + hit_b;
  together = hit_both;

  if ((hit_a == 0U) || (hit_b == 0U))
  {
    printf("     one of them stopped delivering; the source changed under the\n"
           "     measurement, so this comparison says nothing\n");
  }
  else if ((together * 4U) >= (apart * 3U))
  {
    printf("     two streams: accepting both roughly doubled the data, so the\n"
           "     receiver is telling two data types apart\n");
  }
  else if ((lines_a == lines_b) && (bytes_a == bytes_b))
  {
    printf("     one stream: accepting both added nothing and both describe the\n"
           "     same line, so the filter cannot tell 0x%02lx from 0x%02lx. The\n"
           "     two differ in mask 0x%02lx, which the comparison ignores; only\n"
           "     one of them is really on the wire\n",
           (unsigned long)dt_a, (unsigned long)dt_b, (unsigned long)(dt_a ^ dt_b));
  }
  else
  {
    printf("     undecided: no extra data from enabling both, but the two do not\n"
           "     describe the same line either\n");
  }
}

/**
  * @brief  Check a search result against the assumption the search rests on.
  * @retval true if the four probe points are consistent with monotonicity
  *
  * The binary search is only meaningful if "reaches N" is monotonic in N. When
  * the counter fires on something else - a rate, a wrap-around, a value that is
  * never reached at all - the search still returns a number, and that number is
  * indistinguishable from a measurement. Four extra probes cost a few frame
  * periods and turn it into a claim that can visibly fail.
  */
static bool geom_verify(uint32_t vc, uint32_t best, uint32_t timeout_ms,
                        bool (*reached)(uint32_t vc, uint32_t value, uint32_t timeout_ms),
                        const char *what)
{
  bool at_one;
  bool at_half;
  bool at_best;
  bool past;
  bool ok;

  if (best == 0U)
  {
    printf("CSI:   %s: not even 1 was reached - the counter never fired\n", what);
    return false;
  }

  at_one  = reached(vc, 1U, timeout_ms);
  at_half = reached(vc, (best / 2U) + 1U, timeout_ms);
  at_best = reached(vc, best, timeout_ms);
  past    = reached(vc, best + 1U, timeout_ms);
  ok      = at_one && at_half && at_best && (!past);

  printf("CSI:   %s = %lu   [1:%s  %lu:%s  %lu:%s  %lu:%s]\n",
         what, (unsigned long)best,
         at_one ? "y" : "N",
         (unsigned long)((best / 2U) + 1U), at_half ? "y" : "N",
         (unsigned long)best,               at_best ? "y" : "N",
         (unsigned long)(best + 1U),        past    ? "Y" : "n");

  if (!ok)
  {
    printf("CSI:   ^ not monotonic, so this number is not a measurement\n");
  }
  return ok;
}

void csi_probe_geometry(uint32_t vc, csi_probe_vc_info_t *info)
{
  /* Several frame periods, so a miss is a real miss rather than a window that
     fell between two frames. */
  const uint32_t timeout_ms = 120U;
  DCMIPP_CSI_VCFilteringConfTypeDef filter = {0};
  uint32_t first_bytes;
  uint32_t line_max;
  uint32_t byte_max;
  uint32_t bpp;
  bool     lines_ok;
  bool     bytes_ok;

  if ((info == NULL) || (vc >= CSI_PROBE_VC_COUNT))
  {
    return;
  }

  info->lines          = 0U;
  info->bytes_per_line = 0U;
  info->width          = 0U;

  HAL_NVIC_DisableIRQ(CSI_IRQn);
  csi_stop_all_vc();

  /* Accept the image data type and nothing else. HAL_DCMIPP_CSI_SetVCConfig()
     sets ALLDT instead, and then the line counter counts every long packet on
     the channel - embedded data, blanking, anything the source interleaves -
     rather than image lines only. */
  filter.DataTypeNB        = 1U;
  filter.DataTypeClass[0]  = info->image_dt;
  filter.DataTypeFormat[0] = csi_probe_dt_bpp_code(info->image_dt);
  (void)HAL_DCMIPP_CSI_SetVCFilteringConfig(&hcamera_dcmipp, vc, &filter);

  if (!csi_start_vc(vc, 150U))
  {
    printf("CSI: VC%lu did not report the active state; measuring anyway\n", (unsigned long)vc);
  }

  /* Everything below is a counter *index*; the +1 that turns each into a count
     happens after the checks, which have to compare like for like. */
  line_max = csi_search_max(vc, 0xFFFFU, timeout_ms, probe_line);

  /* The first line, kept only for comparison. */
  g_byte_probe_line = 1U;
  first_bytes       = csi_search_max(vc, 0xFFFFU, timeout_ms, probe_byte);

  /* And the middle of the frame, which is where an image line is most likely. */
  g_byte_probe_line = (line_max > 2U) ? (line_max / 2U) : 1U;
  byte_max          = csi_search_max(vc, 0xFFFFU, timeout_ms, probe_byte);

  printf("CSI: VC%lu geometry, counter 0 reading the channel as %s\n", (unsigned long)vc,
         (csi_probe_dt_bpp(info->image_dt) != 0U) ? "the identified format"
                                                  : "8 bpp (format unknown)");
  lines_ok = geom_verify(vc, line_max, timeout_ms, probe_line, "lines     ");
  bytes_ok = geom_verify(vc, byte_max, timeout_ms, probe_byte, "bytes/line");

  /* The counters match on an index, so the last line of a 1080-line frame is
     1079 and the last byte of a 2400-byte line is 2399. Measuring 1919x1079 for
     a 1920x1080 RAW10 source is what made this obvious. */
  info->lines          = (lines_ok) ? (line_max + 1U) : 0U;
  info->bytes_per_line = (bytes_ok) ? (byte_max + 1U) : 0U;

