patrickstreit/STM32CubeN6/Projects/STM32N6570-DK/Applications/VENC/VENC_SDCard_ThreadX/Appli/Core/Src/csi_probe.c
  if (first_bytes != byte_max)
  {
    printf("CSI:   line 1 is %lu bytes, line %lu is %lu - the frame is not\n"
           "         uniform, so some of those lines are not image lines\n",
           (unsigned long)(first_bytes + 1U), (unsigned long)g_byte_probe_line,
           (unsigned long)(byte_max + 1U));
  }

  csi_stop_all_vc();
  /* Leave the channel accepting everything again. */
  (void)HAL_DCMIPP_CSI_SetVCConfig(&hcamera_dcmipp, vc, csi_probe_dt_bpp_code(info->image_dt));
  HAL_NVIC_EnableIRQ(CSI_IRQn);

  bpp = csi_probe_dt_bpp(info->image_dt);
  if ((bpp != 0U) && (info->bytes_per_line != 0U))
  {
    info->width = (info->bytes_per_line * 8U) / bpp;
  }
}

/* ------------------------------------------------------------------------- */
/* Full run and report                                                       */
/* ------------------------------------------------------------------------- */

void csi_probe_report_invalidate(csi_probe_report_t *report)
{
  if (report != NULL)
  {
    memset(report, 0, sizeof(*report));
  }
}

void csi_probe_run(csi_probe_phy_t *phy, csi_probe_report_t *report)
{
  csi_probe_result_t   result;
  csi_probe_vc_info_t *info;
  const uint32_t       window_ms = 500U;

  if ((phy == NULL) || (report == NULL))
  {
    return;
  }

  /* Cleared up front: a run that bails out half way must not leave the previous
     one's numbers behind to be reprinted later. */
  csi_probe_report_invalidate(report);
  info = report->vc;

  if (phy->mbps == 0U)
  {
    /* Try the setting the encoder application uses before sweeping: a sweep
       costs a source restart per combination, and this is very often the answer.
       The restart is what makes it work at all - the transmitter has to come up
       after the receiver, and every bitrate change resets the receiver. */
    csi_probe_phy_t candidate = csi_probe_default_phy;

    printf("CSI: trying the known-good setting first (%u Mbit/s, %u lanes)\n",
           (unsigned)candidate.mbps, (unsigned)candidate.lanes);

    if (csi_probe_wait_for_link(&candidate, 0U))
    {
      *phy = candidate;
    }
    else if (!csi_probe_scan(150U, true, phy))
    {
      return;
    }
  }

  /* Re-measure the chosen setting over a longer window so the per-channel frame
     rate is worth printing. */
  (void)csi_probe_observe(phy, window_ms, true, &result);

  if (result.source_boot_ms == 0U)
  {
    printf("CSI: the source never started; nothing to characterise\n");
    return;
  }
  printf("CSI: source transmitting %lu ms after its restart\n",
         (unsigned long)(result.source_boot_ms - 1U));

  report->phy           = *phy;
  report->link          = result;
  report->link_measured = true;
  report->valid         = true;

  for (uint32_t vc = 0U; vc < CSI_PROBE_VC_COUNT; vc++)
  {
    info[vc].frames  = result.eof[vc];
    info[vc].present = (result.eof[vc] != 0U);
    info[vc].fps_x10 = (result.eof[vc] * 10000U) / window_ms;

    if (!info[vc].present)
    {
      continue;
    }

    csi_probe_datatypes(vc, 150U, &info[vc]);
    csi_probe_geometry(vc, &info[vc]);
  }

  /* Leave each present channel configured for the format it actually carries.
     The D-PHY is deliberately not re-applied here: it already holds this setting
     and the link is up, so touching it would reset the receiver and cost another
     power-cycle for no gain. Only the per-channel format registers are written,
     which the transmitter never sees. */
  for (uint32_t vc = 0U; vc < CSI_PROBE_VC_COUNT; vc++)
  {
    if (info[vc].present)
    {
      (void)HAL_DCMIPP_CSI_SetVCConfig(&hcamera_dcmipp, vc,
                                       csi_probe_dt_bpp_code(info[vc].image_dt));
    }
  }
}

void csi_probe_print_report(const csi_probe_report_t *report, const csi_probe_phy_t *current)
{
  const csi_probe_vc_info_t *info;
  const csi_probe_phy_t     *phy;

  if (report == NULL)
  {
    return;
  }

  if (!report->valid)
  {
    printf("CSI: nothing measured yet - run 'probe'\n");
    return;
  }

  info = report->vc;
  phy  = &report->phy;

  printf("\n=== CSI-2 probe result ===\n");
  printf("D-PHY : %u Mbit/s per lane, %u lane(s), %s mapping\n",
         (unsigned)phy->mbps, (unsigned)phy->lanes,
         (phy->swapped != 0U) ? "inverted" : "physical");

  /* The setting printed above is the one these numbers were taken at, not
     whatever the receiver holds now. Say so when they have drifted apart. */
  if ((current != NULL) &&
      ((current->mbps != phy->mbps) || (current->lanes != phy->lanes) ||
       (current->swapped != phy->swapped)))
  {
    printf("        (the receiver now holds %u Mbit/s, %u lane(s), %s mapping;\n"
           "         these numbers are from the setting above - rerun 'probe')\n",
           (unsigned)current->mbps, (unsigned)current->lanes,
           (current->swapped != 0U) ? "inverted" : "physical");
  }

  if (!report->link_measured)
  {
    printf("Link  : not measured in this run\n");
  }
  else if ((report->link.err_ecc | report->link.err_crc | report->link.err_phy) != 0U)
  {
    printf("Link  : MARGINAL over %lu ms - ecc %lu uncorrectable / %lu corrected, "
           "crc %lu, dphy %lu\n",
           (unsigned long)report->link.window_ms,
           (unsigned long)report->link.err_ecc,
           (unsigned long)report->link.err_ecc_corrected,
           (unsigned long)report->link.err_crc,
           (unsigned long)report->link.err_phy);
    printf("        'refine' compares the neighbouring bitrate profiles;\n");
    printf("        an uncorrectable header ECC error changes the data type value.\n");
  }
  else
  {
    printf("Link  : clean over %lu ms, no ecc/crc/dphy errors\n",
           (unsigned long)report->link.window_ms);
  }

  for (uint32_t vc = 0U; vc < CSI_PROBE_VC_COUNT; vc++)
  {
    if (!info[vc].present)
    {
      continue;
    }

    printf("VC%lu   : %lu.%lu fps, DT 0x%02lx %s",
           (unsigned long)vc,
           (unsigned long)(info[vc].fps_x10 / 10U),
           (unsigned long)(info[vc].fps_x10 % 10U),
           (unsigned long)info[vc].image_dt,
           csi_probe_dt_name(info[vc].image_dt));

